---
kind: property
id: P:Autodesk.Revit.DB.Form.HasOneOrMoreReferenceProfiles
zh: 对话框、窗口、窗体
source: html/beb69916-074b-a484-0485-355b71f10582.htm
---
# Autodesk.Revit.DB.Form.HasOneOrMoreReferenceProfiles Property

**中文**: 对话框、窗口、窗体

Tell if the form has any reference profile.

## Syntax (C#)
```csharp
public bool HasOneOrMoreReferenceProfiles { get; }
```